Autodesk.Revit.DB.Architecture.IWallPlacementPostProcessingServer.ToggleCmd(System.Boolean)
click auto finish button
Since:
2025

Autodesk.Revit.DB.Architecture.IWallPlacementPostProcessingServer.IsChecked(System.Boolean)
check auto finish button state
Since:
2025

Autodesk.Revit.DB.Architecture.IWallPlacementPostProcessingServer.IsEnabled(Autodesk.Revit.DB.WallType,System.Boolean)
check auto finish button state
Since:
2025

Autodesk.Revit.DB.Architecture.IWallPlacementPostProcessingServer.Process(Autodesk.Revit.DB.Architecture.WallPlacementPostProcessingServiceData)
do some thing after wall placement
Since:
2025

Autodesk.Revit.DB.Architecture.IWallPlacementPostProcessingServer
Interface class for external servers implementing post processing of wall placement.
Since:
2025